Repository: phunkyfish/screensaver.asterwave
Catalog: screensaver.asterwave/resources/language/resource.language.*/strings.po
Languages: ca_es, de_de, fi_fi, fr_fr, ru_ru

# Addon Summary
source: AsterWave screensaver
ca_es: Estalvi de pantalla AsterWave
de_de: Bildschirmschoner AsterWave
fi_fi: AsterWave-näytönsäästäjä
fr_fr: Économiseur d'écran AsterWave
ru_ru: Заставка AsterWave

# Addon Description
source: A field of liquid that deforms realistically to changes in height using actual physics equations.[CR][CR]Asteron: This code is adapted from a project I did for a graphics course in 2000. In beta testing this has garnered a lot of praise and I hope for it to replace cpBlobs as the most popular screensaver.
ca_es: Un camp de líquid que es deforma de manera realista als canvis d'alçada utilitzant equacions físiques reals.[CR][CR]Asteron: Aquest codi està adaptat d'un projecte que vaig fer per a un curs de gràfics l'any 2000. En les proves beta, ha obtingut molts elogis i espero que substitueixi cpBlobs com l'estalvi de pantalles més popular.
de_de: Ein Feld aus Flüssigkeit, das sich realistisch verformt, wenn sich die Höhe ändert, wobei echte physikalische Gleichungen verwendet werden.[CR][CR]Asteron: Dieser Code stammt aus einem Projekt, das ich im Jahr 2000 für einen Grafikkurs entwickelt habe. In den Betatests gab es viel Lob und ich hoffe, dass er cpBlobs als den beliebtesten Bildschirmschoner ablösen wird.
fi_fi: Nestekenttä, joka muuttaa muotoaan realistisesti korkeuden muutoksien johdosta todellisia fysiikan yhtälöitä käyttäen.[CR][CR]Asteron: Tämä koodi on lähtöisin projektista, jonka tein grafiikkakurssia varten vuonna 2000. Betatestauksessa tämä keräsi paljon arvostusta ja toiveeni on, että se korvaisi cpBlobs-näytönsäästäjän suosituimpana näytönsäästäjänä.
fr_fr: Un champ de liquide qui se déforme de manière réaliste aux changements de hauteur en utilisant des équations physiques réelles.[CR][CR]Asteron : ce code est adapté d'un projet que j'ai réalisé pour un cours de graphisme en 2000. Lors des tests bêta, cela a suscité de nombreux éloges et j'espère qu'il remplacera cpBlobs en tant qu'économiseur d'écran le plus populaire.
ru_ru: Область с жидкостью, которая реалистично меняет свою форму в зависимости от изменений высот на основе реальных физических формулах. Этот код адаптирован из проекта, который я сделал для курса графики в 2000. Во время бета-тестирования, эта заставка получила большое число положительных отзывов, и я надеюсь, что она станет заменой CpBlobs как самой популярной заставкой.

# #30000
source: General
de_de: Allgemein
fi_fi: Yleiset
fr_fr: Général
ru_ru: Общие

# #30001
source: Quality
ca_es: Qualitat
de_de: Qualität
fi_fi: Laatu
fr_fr: Qualité
ru_ru: Качество

# #30002
source: Determines the resolution of the water field, higher is better/slower... tune it with physics.
ca_es: Determina la resolució del camp d'aigua, més alt és millor/més lent... afina-ho amb la física.
de_de: Bestimmt die Auflösung des Wasserfeldes, höher ist besser/langsamer … einfach mittels Physik anpassen.
fi_fi: Määrittää vesialueen resoluution. Korkeampi arvo on parempi ja raskaampi... Säädä fysiikallla.
fr_fr: Détermine la résolution du champ d'eau, plus c'est haut, mieux c'est/plus lent... accordez-le avec la physique.
ru_ru: Определяет разрешение воды; больше — лучше/медленнее... связано с физикой.

# #30003
source: Shininess
ca_es: Brillantor
de_de: Glanz
fi_fi: Heijastus
fr_fr: Brillance
ru_ru: Блеск

# #30004
source: Shininess of the fluid.
ca_es: Brillantor del fluid.
de_de: Glanz der Flüssigkeit.
fi_fi: Määrittää nesteen heijastavuuden.
fr_fr: Brillance du fluide.
ru_ru: Блеск жидкости.

# #30005
source: Elasticity
ca_es: Elasticitat
de_de: Elastizität
fi_fi: Elastisuus
fr_fr: Élasticité
ru_ru: Эластичность

# #30006
source: Determines the springiness of the water.
ca_es: Determina la elasticitat de l'aigua.
de_de: Bestimmt die Elastizität des Wassers.
fi_fi: Määrittää veden joustavuuden.
fr_fr: Détermine l'élasticité de l'eau.
ru_ru: Определяет волнение воды.

# #30007
source: Viscosity
ca_es: Viscositat
de_de: Viskosität
fi_fi: Viskositeetti
fr_fr: Viscosité
ru_ru: Вязкость

# #30008
source: Determines the how quickly the water quiets down.
ca_es: Determina la rapidesa amb què l'aigua es calma.
de_de: Legt fest, wie schnell sich das Wasser beruhigt.
fi_fi: Määrittää veden tyyntymisnopeuden.
fr_fr: Détermine la vitesse à laquelle l'eau se calme.
ru_ru: Определяет, как быстро затихают волны воды.

# #30009
source: X position max
ca_es: Màxim de la posició X
de_de: Maximale X-Position
fi_fi: X-sijainnin enimmäisarvo
fr_fr: Position X max
ru_ru: Максимальная позиция по горизонтали

# #30010
source: For field rectangle and height.
ca_es: Rectangle i alçada pel camp.
de_de: Für Feldrechteck und Höhe.
fi_fi: Kentän suorakulmiolle ja korkeudelle.
fr_fr: Pour la base du rectangle et la hauteur.
ru_ru: Для прямоугольника поля и высоты.

# #30011
source: X position min
ca_es: Mínim de la posició X
de_de: Minimale X-Position
fi_fi: X-sijainnin vähimmäisarvo
fr_fr: Position X min
ru_ru: Минимальная позиция по горизонтали

# #30012
source: For field rectangle and height.
ca_es: Rectangle i alçada pel camp.
de_de: Für Feldrechteck und Höhe.
fi_fi: Kentän suorakulmiolle ja korkeudelle.
fr_fr: Pour la base du rectangle et la hauteur.
ru_ru: Для прямоугольника поля и высоты.

# #30013
source: Y position max
ca_es: Màxim de la posició Y
de_de: Maximale Y-Position
fi_fi: Y-sijainnin enimmäisarvo
fr_fr: Position Y max
ru_ru: Максимальная позиция по горизонтали

# #30014
source: For field rectangle and height.
ca_es: Rectangle i alçada pel camp.
de_de: Für Feldrechteck und Höhe.
fi_fi: Kentän suorakulmiolle ja korkeudelle.
fr_fr: Pour la base du rectangle et la hauteur.
ru_ru: Для поля прямоугольника и высоты.

# #30015
source: Y position min
ca_es: Mínim de la posició Y
de_de: Minimale Y-Position
fi_fi: Y-sijainnin vähimmäisarvo
fr_fr: Position Y min
ru_ru: Минимальная позиция по горизонтали

# #30016
source: For field rectangle and height.
ca_es: Rectangle i alçada pel camp.
de_de: Für Feldrechteck und Höhe.
fi_fi: Kentän suorakulmiolle ja korkeudelle.
fr_fr: Pour la base du rectangle et la hauteur.
ru_ru: Для поля прямоугольника и высоты.

# #30017
source: Height
ca_es: Alçada
de_de: Höhe
fi_fi: Korkeus
fr_fr: Hauteur
ru_ru: Высота

# #30018
source: For field rectangle and height.
ca_es: Rectangle i alçada pel camp.
de_de: Für Feldrechteck und Höhe.
fi_fi: Kentän suorakulmiolle ja korkeudelle.
fr_fr: Pour la base du rectangle et la hauteur.
ru_ru: Для поля прямоугольника и высоты.

# #30019
source: Wireframe
ca_es: Malla
de_de: Drahtmodell
fi_fi: Rautalankatila
fr_fr: Fil de fer
ru_ru: Каркас

# #30020
source: Wireframe mode.
ca_es: Mode de la malla.
de_de: Drahtgittermodus.
fi_fi: Käytä rautalankamallia.
fr_fr: Mode filaire.
ru_ru: Режим каркаса.

# #30021
source: Texture mode
ca_es: Mode de la textura
de_de: Texturmodus
fi_fi: Tekstuuritila
fr_fr: Mode Texture
ru_ru: Режим текстур

# #30022
source: True uses a texture as a reflection map, False uses awesome colors.
ca_es: True utilitza una textura com a mapa de reflexió, False utilitza colors impressionants.
de_de: Wahr verwendet eine Textur als Reflexionskarte, Falsch verwendet fantastische Farben.
fi_fi: Käytä heijastuskarttana tekstuuria tai hienoja värejä.
fr_fr: Actif utilise une texture comme carte de réflexion, inactif utilise des couleurs impressionnantes.
ru_ru: Истина: использовать текстуры как карту отражений; ложь: использовать прикольные цвета.

# #30023
source: Texture folder
ca_es: Carpeta de la textura
de_de: Texturordner
fi_fi: Tekstuurikansio
fr_fr: Dossier de textures
ru_ru: Папка текстур

# #30024
source: Textures are chosen randomly from the following folder.
ca_es: Les textures es trien aleatòriament de la carpeta següent.
de_de: Texturen werden zufällig aus dem folgenden Ordner ausgewählt.
fi_fi: Tekstuurit valitaan satunnaisesti tästä kansiosta.
fr_fr: Les textures sont choisies au hasard dans le dossier suivant.
ru_ru: Текстуры выбираются случайно из следующей папки.

# #30025
source: Next texture
ca_es: Següent textura
de_de: Nächste Textur
fi_fi: Seuraava tekstuuri
fr_fr: Texture suivante
ru_ru: Следующая текстура

# #30026
source: Time in seconds between texture transitions (slideshow).
ca_es: Temps en segons entre transicions de textura (presentació de diapositives).
de_de: Zeit in Sekunden zwischen Texturübergängen (Diashow).
fi_fi: Tekstuurien vaihtoväli (sekuntia).
fr_fr: Temps en secondes entre les transitions de texture (diaporama).
ru_ru: Время в секундах между сменой текстур (слайд-шоу).

# #30027
source: %i seconds
ca_es: %i segons
de_de: %i Sekunden
fi_fi: %i sekuntia
fr_fr: %i secondes
ru_ru: %i секунд
